In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

C:\Users\Alex\AppData\Local\Temp\ipykernel_2564\686016230.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
financials = pd.DataFrame({'month' :   ['01/01/2019', '01/02/2019', '01/03/2019', '01/03/2019', '01/04/2019', '01/05/2019', '01/06/2019', '01/07/2019', '01/08/2019', '01/09/2019', '01/10/2019', '01/11/2019', '01/12/2019', '01/12/2019'],
                           'profit' : ['1.20$', '1.30$', '1.25$', '1.25$', '1.27$', '1.11$', '1.23$', '1.20$', '1.31$', '1.24$', '1.18$', '1.17$', '1.23$', '1.23$'],
                           'MoM' :     [0.03, -0.02, 0.01, 0.02, -0.01, -0.015, 0.017, 0.04, 0.02, 0.01, 0.00, -0.01, 2.00, 2.00],
                           'high' :    ['Dubai', 'Paris', 'singapour', 'singapour', 'moscow', 'Paris', 'Madrid', 'moscow', 'london', 'london', 'Moscow', 'Rome', 'madrid', 'madrid']
                           })
 
financials

         month profit    MoM       high
0   01/01/2019  1.20$  0.030      Dubai
1   01/02/2019  1.30$ -0.020      Paris
2   01/03/2019  1.25$  0.010  singapour
3   01/03/2019  1.25$  0.020  singapour
4   01/04/2019  1.27$ -0.010     moscow
5   01/05/2019  1.11$ -0.015      Paris
6   01/06/2019  1.23$  0.017     Madrid
7   01/07/2019  1.20$  0.040     moscow
8   01/08/2019  1.31$  0.020     london
9   01/09/2019  1.24$  0.010     london
10  01/10/2019  1.18$  0.000     Moscow
11  01/11/2019  1.17$ -0.010       Rome
12  01/12/2019  1.23$  2.000     madrid
13  01/12/2019  1.23$  2.000     madrid

In [3]:
financials.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   14 non-null     object
 1   profit  14 non-null     object
 2   MoM     14 non-null     float64
 3   high    14 non-null     object
dtypes: float64(1), object(3)
memory usage: 580.0+ bytes

In [4]:
# Дубликаты
# Поиск дубликатов

In [5]:
financials.duplicated(keep='first')

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
dtype: bool

In [6]:
financials.duplicated(keep='last')

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
dtype: bool

In [7]:
financials[financials.duplicated(keep = 'first')]

         month profit  MoM    high
13  01/12/2019  1.23$  2.0  madrid

In [8]:
# с помощью параметра subset мы ищем дубликаты по конкретным столбцам
financials.duplicated(subset = ['month'])

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
dtype: bool

In [9]:
# посчитаем количество дубликатов по столбцу month
financials.duplicated(subset = ['month']).sum()

2

In [10]:
# укажем параметр keep = 'last', больше доверяя, таким образом,
# последнему записанному за конкретный месяц значению
financials[financials.duplicated(subset = ['month'], keep = 'last')]

         month profit   MoM       high
2   01/03/2019  1.25$  0.01  singapour
12  01/12/2019  1.23$  2.00     madrid

In [12]:
( ~ financials.duplicated(subset = ['month'])).sum()

12

In [13]:
financials[ ~ financials.duplicated(subset = ['month'], keep = 'last')]

         month profit    MoM       high
0   01/01/2019  1.20$  0.030      Dubai
1   01/02/2019  1.30$ -0.020      Paris
3   01/03/2019  1.25$  0.020  singapour
4   01/04/2019  1.27$ -0.010     moscow
5   01/05/2019  1.11$ -0.015      Paris
6   01/06/2019  1.23$  0.017     Madrid
7   01/07/2019  1.20$  0.040     moscow
8   01/08/2019  1.31$  0.020     london
9   01/09/2019  1.24$  0.010     london
10  01/10/2019  1.18$  0.000     Moscow
11  01/11/2019  1.17$ -0.010       Rome
13  01/12/2019  1.23$  2.000     madrid

In [14]:
financials.drop_duplicates(keep='last',
                           subset=['month'],
                           ignore_index=True,
                           inplace=True)
financials

         month profit    MoM       high
0   01/01/2019  1.20$  0.030      Dubai
1   01/02/2019  1.30$ -0.020      Paris
2   01/03/2019  1.25$  0.020  singapour
3   01/04/2019  1.27$ -0.010     moscow
4   01/05/2019  1.11$ -0.015      Paris
5   01/06/2019  1.23$  0.017     Madrid
6   01/07/2019  1.20$  0.040     moscow
7   01/08/2019  1.31$  0.020     london
8   01/09/2019  1.24$  0.010     london
9   01/10/2019  1.18$  0.000     Moscow
10  01/11/2019  1.17$ -0.010       Rome
11  01/12/2019  1.23$  2.000     madrid

In [18]:
# Неверные значения

In [15]:
financials.MoM.mean()

0.1735

In [16]:
financials.iloc[11,2] = 0.02

In [17]:
financials.MoM.mean()

0.008499999999999999

In [19]:
# Форматирование значений
# Тип str вместо float

In [20]:
financials.profit.sum()

'1.20$1.30$1.25$1.27$1.11$1.23$1.20$1.31$1.24$1.18$1.17$1.23$'

In [22]:
# удалим знак доллара ($)
financials['profit'] = financials['profit'].str.strip('$')
# заменим тип данных на FLOAT
financials['profit'] = financials['profit'].astype('float')

In [23]:
financials.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   12 non-null     object
 1   profit  12 non-null     float64
 2   MoM     12 non-null     float64
 3   high    12 non-null     object
dtypes: float64(2), object(2)
memory usage: 516.0+ bytes

In [24]:
# проверим превратился ли тип данных во float
assert financials.profit.dtype == float

In [26]:
financials.profit.sum()

14.69

In [27]:
# Названия городов с заглавной буквы